diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>CatalogRef.ВКМ_ПериодыОтпусков</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Превышено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	// ВКМ Начало доработки
	ТекДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.ДатаНачала) И ЗначениеЗаполнено(ТекДанные.ДатаОкончания) Тогда
		ВКМ_ПосчитатьКоличествоДней(ТекДанные.Сотрудник, ТекДанные.НомерСтроки);
	КонецЕсли;
	// ВКМ Конец докработки
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	// ВКМ Начало доработки
	ТекДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.ДатаНачала) И ЗначениеЗаполнено(ТекДанные.ДатаОкончания) Тогда
		ВКМ_ПосчитатьКоличествоДней(ТекДанные.Сотрудник, ТекДанные.НомерСтроки);
	КонецЕсли;
	// ВКМ Конец докработки

КонецПроцедуры 

// ВКМ Начало доработки
Функция ВКМ_ПосчитатьКоличествоДней(Сотрудник, НомерСтроки) 
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	Таблица.НомерСтроки КАК НомерСтроки,
	 |	Таблица.Сотрудник КАК Сотрудник,
	 |	Таблица.ДатаНачала КАК ДатаНачала,
	 |	Таблица.ДатаОкончания КАК ДатаОкончания
	 |ПОМЕСТИТЬ ВТ_Таблица
	 |ИЗ
	 |	&Таблица КАК Таблица
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ_Таблица.Сотрудник КАК Сотрудник,
	 |	СУММА(РАЗНОСТЬДАТ(ВТ_Таблица.ДатаНачала, ВТ_Таблица.ДатаОкончания, ДЕНЬ)) КАК КоличествоДнейВсего
	 |ПОМЕСТИТЬ ВТ_Всего
	 |ИЗ
	 |	ВТ_Таблица КАК ВТ_Таблица
	 |ГДЕ
	 |	ВТ_Таблица.Сотрудник = &Сотрудник
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВТ_Таблица.Сотрудник
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ_Таблица.НомерСтроки КАК НомерСтроки,
	 |	ВТ_Таблица.Сотрудник КАК Сотрудник,
	 |	РАЗНОСТЬДАТ(ВТ_Таблица.ДатаНачала, ВТ_Таблица.ДатаОкончания, ДЕНЬ) КАК КоличествоДнейПериод
	 |ПОМЕСТИТЬ ВТ_Период
	 |ИЗ
	 |	ВТ_Таблица КАК ВТ_Таблица
	 |ГДЕ
	 |	ВТ_Таблица.Сотрудник = &Сотрудник
	 |	И ВТ_Таблица.НомерСтроки = &НомерСтроки
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ_Всего.КоличествоДнейВсего КАК КоличествоДнейВсего,
	 |	ВТ_Всего.Сотрудник КАК Сотрудник,
	 |	ВТ_Период.НомерСтроки КАК НомерСтроки,
	 |	ВТ_Период.КоличествоДнейПериод КАК КоличествоДнейПериод
	 |ИЗ
	 |	ВТ_Всего КАК ВТ_Всего
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Период КАК ВТ_Период
	 |		ПО ВТ_Всего.Сотрудник = ВТ_Период.Сотрудник";
	 
	 Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	 Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);
	 Запрос.УстановитьПараметр("Таблица", Объект.ОтпускаСотрудников.Выгрузить());
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 
	 Выборка.Следующий();
	 
	 СтруктураПоиска = Новый Структура("Сотрудник", Сотрудник);
	 НайденныеСтроки = Объект.ОтпускаСотрудников.НайтиСтроки(СтруктураПоиска);
	 
	 Для Каждого Строка Из НайденныеСтроки Цикл
		 Если Выборка.КоличествоДнейВсего > 28 Тогда
			 Строка.Превышено = Истина;
		 Иначе
			 Строка.Превышено = Ложь;
		 КонецЕсли;
	 КонецЦикла;
	 
	 СтруктураПоиска = Новый Структура("НомерСтроки", НомерСтроки);
	 НайденныеСтроки = Объект.ОтпускаСотрудников.НайтиСтроки(СтруктураПоиска);
	 НайденныеСтроки[0].КоличествоДней = Выборка.КоличествоДнейПериод;
	 	 
КонецФункции

&НаСервере
Функция ВКМ_АнализГрафикаНаСервере()
	
	ТаблицаДанных = Объект.ОтпускаСотрудников.Выгрузить();
	АдресХранилища = ПоместитьВоВременноеХранилище(ТаблицаДанных, );
	Возврат АдресХранилища;
	
КонецФункции

&НаКлиенте
Процедура ВКМ_АнализГрафика(Команда)
	
	АдресХранилища = ВКМ_АнализГрафикаНаСервере();
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", 
	Новый Структура("АдресХранилища", АдресХранилища));
	
КонецПроцедуры
// ВКМ Конец докработки
